# Probamos la funcion para saber si alguien esta en casa o no

In [8]:
import pandas as pd
import tensorflow as tf

data_list1 = [[39.0, 116.0, '2008-10-23 13:53:88', '000'],
             [39.984198, 116.319322, '2008-10-23 13:53:06', '000'],
             [39.984094, 116.319236, '2008-10-23 13:53:11', '000'],
             [39.0, 116.0, '2008-10-23 13:599:99', '000'],
             [39.984123, 116.319437, '2010-23 13:53:44', '000'],
             [39.984123, 116.319437, '2008-23 13:53:55', '000'],
             [39.0, 117.0, '2008-10-23 13:53', '001'],
             [39.0, 116.0, '2008-10-23 13:53:12', '002'],
             [39.984324, 116.319421, '2008-10-23 13:53:111', '001']]
data_columns  = ['lat', 'lng', 'datetime', 'uid']

In [9]:

df_test1 = pd.DataFrame(data_list1, columns=data_columns)
df_test1['at_home'] = 0
df_test1

         lat         lng              datetime  uid  at_home
0  39.000000  116.000000   2008-10-23 13:53:88  000        0
1  39.984198  116.319322   2008-10-23 13:53:06  000        0
2  39.984094  116.319236   2008-10-23 13:53:11  000        0
3  39.000000  116.000000  2008-10-23 13:599:99  000        0
4  39.984123  116.319437      2010-23 13:53:44  000        0
5  39.984123  116.319437      2008-23 13:53:55  000        0
6  39.000000  117.000000      2008-10-23 13:53  001        0
7  39.000000  116.000000   2008-10-23 13:53:12  002        0
8  39.984324  116.319421  2008-10-23 13:53:111  001        0

In [10]:
data_list2 = [[39.0, 116.0, '000'],
             [39.984324, 116.319421, '001']]
data_columns  = ['lat', 'lng', 'uid']
df_test2 = pd.DataFrame(data_list2, columns=data_columns)
df_test2['at_home'] = 1
df_test2

         lat         lng  uid  at_home
0  39.000000  116.000000  000        1
1  39.984324  116.319421  001        1

In [11]:

df_test1 = pd.merge(df_test1, df_test2, on=['lat','lng','uid'], how='left')
df_test1

         lat         lng              datetime  uid  at_home_x  at_home_y
0  39.000000  116.000000   2008-10-23 13:53:88  000          0        1.0
1  39.984198  116.319322   2008-10-23 13:53:06  000          0        NaN
2  39.984094  116.319236   2008-10-23 13:53:11  000          0        NaN
3  39.000000  116.000000  2008-10-23 13:599:99  000          0        1.0
4  39.984123  116.319437      2010-23 13:53:44  000          0        NaN
5  39.984123  116.319437      2008-23 13:53:55  000          0        NaN
6  39.000000  117.000000      2008-10-23 13:53  001          0        NaN
7  39.000000  116.000000   2008-10-23 13:53:12  002          0        NaN
8  39.984324  116.319421  2008-10-23 13:53:111  001          0        1.0

In [12]:

df_test1['at_home'] = df_test1['at_home_y'].fillna(df_test1['at_home_x'])  
df_test1 = df_test1.drop(['at_home_x','at_home_y'], axis=1)
df_test1

         lat         lng              datetime  uid  at_home
0  39.000000  116.000000   2008-10-23 13:53:88  000      1.0
1  39.984198  116.319322   2008-10-23 13:53:06  000      0.0
2  39.984094  116.319236   2008-10-23 13:53:11  000      0.0
3  39.000000  116.000000  2008-10-23 13:599:99  000      1.0
4  39.984123  116.319437      2010-23 13:53:44  000      0.0
5  39.984123  116.319437      2008-23 13:53:55  000      0.0
6  39.000000  117.000000      2008-10-23 13:53  001      0.0
7  39.000000  116.000000   2008-10-23 13:53:12  002      0.0
8  39.984324  116.319421  2008-10-23 13:53:111  001      1.0

# Probamos a crear un modelo con Tensorflow, y pasar la data a tensores

In [17]:
from tensorflow import keras
from tensorflow.keras import layers

def build_model():
  model = keras.Sequential([
    layers.Dense(32, activation='relu', input_shape=[3]),
    layers.Dense(32, activation='relu'),
    layers.Dense(1, activation = 'sigmoid')
  ])

  model.compile(loss='binary_crossentropy',
                optimizer='adam',
                metrics=['accuracy'])
  return model

model = build_model()

In [16]:

model.summary()

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 32)                128
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 33
=================================================================
Total params: 1,217
Trainable params: 1,217
Non-trainable params: 0
_________________________________________________________________